<template>
    <div class="wrapBox">
        <div class="inner bg-white">
            <div class="box p30 g6 f28" ref="input1">
                <b class="f36 tc pb30">借款合同</b>
                <b class="tr pr100">合同编号：{{protocolInfo.contactCode}}</b>
                <b class="ti pb20">特别提醒：在借款人确认同意本合同之前，借款人应事先了解本合同条款的全部内容，
                    同意向上海市商业银行股份有限公司（以下简称”贷款人”或“上海银行”）申请贷
                    款。一旦借款人在贷款人或其合作平台的软件客户端/网页点击确认或以其他方式选择
                    接受本合同，即意味着借款人已阅读本合同所有条款，并对本合同条款的含义及相应
                    的法律后果已全部通晓并充分理解，同意接受本合同约束。
                    为充分维护借款人的合法权益，贷款人特别提醒借款人特别关注本合同条款中的黑体
                    及/或加下划线部分（包括但不限于第五条、第七条、第八条、第十一条至第十九条
                    等），请借款人务必仔细阅读。
                </b>
                <b>第一条 贷款基本信息
                </b>
                <p>为了保护借款人的信息，本合同在上海银行线上贷款平台及/或其合作平台展示时部分
                    隐藏借款人的敏感信息（本合同对借款人敏感信息的部分隐藏不影响本合同的效力；
                    借款人知晓并同意本合同项下借款人的身份信息以借款人用以签约的账户（在上海市
                    商业银行股份有限公司处开立的银行账户，以实际签约的账户类型为准）留存信息为
                    准。
                </p>
                <b>借款人：{{protocolInfo.applyUser}}</b>
                <b>证件号码：{{protocolInfo.idCard}}</b>
                <b>贷款金额（元）：{{protocolInfo.loanAmount}}</b>
                <b>贷款起止日：{{protocolInfo.startTime}}</b>
                <b>贷款初始日利率（年利率）：{{protocolInfo.interest*100+"%"}}</b>
                <b>利率模式：{{protocolInfo.interestMode==0?'固定利率':''}}</b>
                <b>收款账户：{{protocolInfo.payeeAccount}}</b>
                <b>还款账户：{{protocolInfo.repayAccount}}</b>
                <b>还款方式：{{protocolInfo.repayType==0?'等额本息':''}}</b>
                <b>提前还款：{{protocolInfo.isPrepay==0?'否':''}}</b>
                <b>合同签署日期：{{protocolInfo.signTime}}</b>
                <b>合同签订地：{{protocolInfo.signAddress}}</b>
                <b>第二条 借款人确认</b>
                <b>借款人在签约前须确认并保证借款人同时满足以下条件，并承诺在本合同有效期内始
                    终有效：</b>
                <p>1， 借款人应具有签订和履行本合同的资格和能力，可以独立地作为一方诉讼主体；
                </p>
                <p>2， 借款人签订本合同已获得所有必需的授权或批准，签订和履行本合同不违反借款
                    人作为签约一方的任何协议以及相关法律法规的规定，与借款人应承担的其他合
                    同项下的义务均无抵触；
                </p>
                <p>3， 借款人的交易行为、贷款用途真实、合法、有效，不存在任何虚假；
                </p>
                <p>4， 使用以借款人本人名义开户并设置了密码的借款人用以签约的账户（上海银行二
                    类户）在上海银行线上贷款平台及/或其合作平台所从事的所有行为均视为借款人
                    本人行为，包括但不限于订立本合同、申请支用贷款和归还贷款等，该等行为的
                    法律后果均由借款人本人承担；
                </p>
                <p>5， 借款人有足够的偿债能力归还本合同项下的贷款本息及相关费用（若有）；</p>
                <p>6， 借款人提供给贷款人的所有文件和资料都是真实、准确、完整和有效的，不存在
                    虚假记载、重大遗漏或误导性陈述；
                </p>
                <p>7， 本合同第一条所述借款人的收还款账户为借款人所有并使用；</p>
                <b>8， 借款人确认，贷款人已提请借款人特别注意本合同中有关借款人权利义务的全部
                    条款，并应借款人的要求对该等条款作了相应的说明。
                </b>
                <b>第三条 合同构成</b>
                <p>本合同由本合同条款，借款人在上海银行线上贷款平台及/或其合作平台信息系统填写
                    的所有信息以及上海银行线上贷款平台及/或其合作平台各项规则以及与本贷款相关的
                    网络页面信息组成，各组成部分均具有法律效力，其余组成部分与本合同条款有冲突
                    的以本合同条款为准。
                </p>
                <b>第四条 合同形式及签署方式</b>
                <p>借款人与贷款人一致同意本合同以数据电文形式订立、采用电子签名方式签署并认同
                    其效力。
                </p>
                <b>第五条 合同的生效</b>
                <b>借款人在上海银行线上贷款平台及/或合作平台确认本合同后并不导致本合同立即生效，
                    仅在贷款人审核通过并将贷款资金划入本合同第一条约定的收款账户时，本合同开始
                    生效。
                </b>
                <b>第六条 贷款发放</b>
                <p>借款人同意，贷款人将通过线上贷款系统将贷款资金全额发放至本合同第一条约定的
                    收款账户，将可能存在多笔到账的情况。</p>
                <p>本合同项下的贷款发放日为贷款资金划至收款账户的日期。
                </p>
                <b>第七条 贷款金额</b>
                <p>贷款金额具体参见本合同第一条，贷款发放后，借款人可以登录上海银行直销银行
                    （APP 名：“上海银行直销银行”，下同）查询。
                </p>
                <p>若因上海银行线上贷款平台、合作平台或与本合同项下的贷款相关的其他网络系统原
                    因导致贷款人实际发放给借款人的贷款金额（以下简称“实际发放金额”）与按本合
                    同第一条约定的贷款金额不一致，则借款人和贷款人同意按以下规则调整：
                    若实际发放金额小于约定的贷款金额，则借款人同意最终的贷款金额以实际发放金额
                    为准。
                    若实际发放金额大于约定贷款金额，则借款人同意最终的贷款金额以本合同第一条约
                    定的贷款金额为准，贷款人有权要求借款人返还相当于实际发放金额与本合同第一条
                    约定的贷款金额之差额的资金，借款人在接到贷款人书面通知之日起 5 个工作日内应
                    无条件将前述差额资金返还给贷款人，贷款人对在上述 5 个工作日内返还的该差额资
                    金不计利息，<strong>否则超过上述时限后借款人应就该等差额资金按本合同第十条规定的逾
                        期罚息利率向贷款人加付违约金，且借款人同意贷款人根据本合同第十一条还款的约
                        定发起代扣还款操作。</strong></p>
                <b>第八条 贷款期限</b>
                <b>除本合同另有约定外，借款人的贷款期限可参见本合同第一条（实际以上海银行线上
                    贷款平台及/或其合作平台显示为准）。在技术许可的情况下，借款人可根据自身需要
                    通过页面功能选择贷款期限种类（包括按日借款类或按月借款类，具体以系统设定为
                    准）。本贷款不可展期。</b>
                <b>特别提示：由于贷款人将于还款日中午 12:00（北京时间，下同）进行到期扣款操作，
                    且按月借款类贷款中存在统一还款日概念（详见本合同还款日描述）故借款人的贷款
                    期限可能缩短或延长，对此借款人予以认可。</b>
                <b>发生以下任一情形时，贷款人有权自主决定本合同项下已发放的部分或全部贷款提前
                    到期：</b>
                <b>1， 借款人未能按本合同约定偿付到期本金和/或利息的；
                </b>
                <b>2， 贷款人发现借款人存在交易异常、套现或实际用款与所述贷款用途不符的；
                </b>
                <b>3， 贷款人认为借款人存在本合同约定的任一违约情形或违反本合同任何条款的；</b>
                <b>4， 借款人对贷款人的其他债务已到期（包括宣布提前到期的）后仍未偿还，或者借
                    款人不履行或违反借款人与贷款人，贷款人关联公司其他合同（如有）项下借款
                    人应承担的任何义务，已经或可能影响借款人履行本合同项下的义务；
                </b>
                <b>5， 借款人在贷款人相关方的任何账户（包括但不限于一类账户，二类账户，三类账
                    户）发生异常现象（包括但不限于账户被司法机关冻结，账户被止付或被暂停，
                    终止使用等）；
                </b>
                <b>6， 借款人资金回笼情况不符合贷款人制定的贷款监控规则的；</b>
                <b>7， 借款人发生其他重大不利变化，已经或可能影响借款人履行本合同项下义务的能
                    力。
                </b>
                <b>第九条 贷款用途</b>
                <p>本合同项下的贷款应用于借款人<strong>日常经营用途</strong></p>
                <b>第十条 贷款利率，罚息利率和计息、结息、付息
                </b>
                <p>一， 贷款利率与罚息利率
                </p>
                <p>（一） 贷款利率</p>
                <p>1. 借款人的贷款利率采用年利率并将按日计算，具体参见本合同第一条。
                </p>
                <p>2. 合同第一条贷款初始日利率为贷款原始利率，如利率模式采用固定利率，则在借款
                    发放后，合同期内不调整利率；如利率模式采用浮动利率，则在借款发放后，如遇
                    中国人民银行调整同档次贷款基准利率，本合同项下借款利率按照自基准利率调整
                    之日起自动调整。
                </p>
                <p>（二） 罚息利率</p>
                <p>本合同项下贷款逾期的罚息利率为在上述（一）项贷款初始日利率水平上加收 50%；
                    借款人未按本合同约定用途使用贷款的罚息利率为在上述（一）项贷款初始日利率水
                    平上加收 100%。
                </p>
                <p>二， 计息结息付息
                </p>
                <p>1. 贷款利息自贷款发放日起（含发放当日）计算，按日计息，按本合同第十条的约定
                    进行结息、付息。
                </p>
                <p>2. 如借款人未能按期归还贷款本金（包括被贷款人宣布全部或部分提前到期的贷款本
                    金），贷款人有权自逾期之日起按本合同约定的逾期罚息利率计收罚息。对借款人
                    未按时支付的利息，按逾期罚息利率计收复利。
                </p>
                <p>3. 如借款人未按本合同约定用途使用贷款的，贷款人有权自贷款被挪用之日起，对被
                    挪用部分按本合同约定的挪用贷款罚息利率计收罚息，贷款被挪用期间未按时支付
                    的利息，按挪用贷款罚息利率计收复利。
                </p>
                <p>对于既逾期又未按本合同约定用途使用贷款的，择较重者计收罚息，不予并处。
                </p>
                <b>第十一条 还款</b>
                <b>一， 还款方式</b>
                <b>除另有约定外，本合同项下的贷款的还款方式为下述方式其中之一，具体详见本合同
                    的第一条：</b>
                <b>1， 等额本息还款：即按贷款人的要求，除贷款到期日外每期以相对固定金额偿还贷
                    款本息，贷款到期日则根据实际资金使用天数归还剩余本金及利息。</b>
                <b>2， 到期一次性还本付息:即贷款到期日一次性归还贷款本金及相应利息。</b>
                <b>二， 还款日</b>
                <b>1， 借款人等额本息还款类贷款的还款日详见合作平台或下载上海银行直销银行进行
                    查询。
                </b>
                <b>2， 借款人在贷款人处一次性还本付息类贷款的还款日以实际贷款到期日为准。
                </b>
                <b>三， 应还款额</b>
                <b>对于本合同项下之贷款本金和/或相应利息，借款人应按本合同约定的还款方式还款。
                    贷款人将根据借款人的还款方式，贷款本金，还款日期，贷款期限和贷款利率等为借
                    款人计算借款人每个还款日的相应还款额（包括应还本金和/或应还利息）。借款人可
                    在上海银行直销银行或合作平台查询借款人每个还款日的应还款额，默认选择还款账
                    户途径归还上述贷款。
                </b>
                <b>四， 到期还款
                </b>
                <b>1， 借款人除主动发起还款外，同意授权贷款人或贷款人指定的第三方用自动扣款的
                    方式归还贷款。借款人应确保用于还款账户余额充足，并在每个还款日中午 12：
                    00（北京时间，下同）或之前，将应还贷款本息和相应费用（如有）足额存入相
                    应账户，且借款人同意贷款人在每个还款日自借款人还款账户中扣收上述款项。
                    借款人应知晓，到期自动扣款功能仅系贷款人为方便借款人还款而提供的一项便
                    捷服务，其可能受系统、技术、网络等各类因素的限制而导致还款失败或不能；
                    因此自动扣款并不意味着贷款人承诺或担保到期日必定还款成功或免除借款人的
                    还款义务。相反的，作为借款人应密切注意还款提示及结果，若出现自动扣款失
                    败或不能，应及时履行主动还款的义务，因延误或拒绝还款导致的贷款逾期损失
                    由借款人自行承担。
                </b>
                <b>2， 每个还款日当天，若借款人还款账户的其他代扣服务的扣款时间优先于贷款人发
                    起的贷款还款扣款时间，借款人应当通过其他途径按时还款（包括但不限于通过
                    上海银行直销银行主动还款），以免逾期。
                </b>
                <b>3， 借款人的还款时间以贷款人或贷款人指定的第三方从借款人的还款账户实际划扣
                    到还款资金的时间为准，还款金额以贷款人实际收到借款人的还款金额为准。贷
                    款人有权将借款人的还款首先用于偿还本合同约定的应由借款人承担而由贷款人
                    垫付的各项费用以及贷款人实现债权的费用（以下统称为“费用”），包括但不
                    限于诉讼费，律师代理费，催收费用等，剩余款项按照先还息后还本、利随本清
                    的原则偿还；且贷款人有权对借款人还款的清偿顺序做出合理调整。
                </b>
                <b>五， 逾期还款
                </b>
                <b>借款人同意并不可撤销地授权，若借款人的还款账户余额不足以归还任何其在贷款人
                    及相关公司处已到期（含提前到期）债务的，贷款人有权采取如下措施，而无论下述
                    措施中提及的存款、应收、留存款项是否到期或资产是否届至赎回期，贷款人不承担
                    借款人因此产生的损失：
                </b>
                <b>1， 对借款人的所有宜宾银行账户（如有）采取冻结存款和其他资产，停止取现，限
                    制转账等限制措施；
                </b>
                <b>2， 从借款人的任何一个或多个银行账户（如有）存款或其他资产（包括但不限于已
                    止付的各类保证金）中优先扣划应还费用（如有）和本息，直至欠款全部还清。
                </b>
                <b>3， 若借款人在贷款人关联公司处有任何应收或留存款项，贷款人有权直接通过其关
                    联公司自前述款项中扣收相应金额用以偿还借款人在本合同项下的欠款。
                </b>
                <b>六， 提前还款</b>
                <b>1. 贷款期限届满前，在征得贷款人同意的前提下，借款人可提前归还全部或部分贷款
                    本金。由于借款人提前还款将导致贷款人利息收入的减少，故贷款人有权按照借款
                    人届时所提前归还的贷款本金的一定比例收取提前还款服务费，具体收费标准详见
                    本合同第一条提前还款服务费费率，若第一条无提前还款服务费费率，则借款人提
                    前还款不收取任何费用。贷款人有权在贷款期限内调整提前还款服务费费用收取标
                    准，调整后的费用收取标准将提前在上海银行线上贷款平台及/或其合作平台、上
                    海银行直销银行或通过短信方式进行公告。</b>
                <b>2. 借款人所还款项将按照先偿还截至提前还款日的费用（如有），再偿还全部贷款截
                    至提前还款的全部利息，余额偿还本金的顺序予以操作，且贷款人有权对前述还款
                    清偿顺序做出合理调整。</b>
                <b>3. 贷款人有权根据借款人的实际情况要求借款人以除本条所述方式以外的其他方式
                    （包括但不限于调整每期偿还金额等）偿还本合同项下的贷款。
                </b>
                <b>第十二条 权利和义务
                </b>
                <p>一， 借款人的主要权利和义务</p>
                <p>1， 借款人有权要求贷款人对借款人提供的资料以及相关信息予以保密，但法律法规
                    另有规定或本合同另有约定的除外。
                </p>
                <p>2， 借款人为签署本合同所需的全部手续均已办理完毕并充分有效。借款人签署本合
                    同、履行其在本合同项下的义务，均不会与对借款人有约束力的任何合同、协议
                    及其他文件相抵触。</p>
                <p>3， 借款人保证其在上海银行线上贷款平台及/或合作平台中提供的任何信息均真实、
                    合法、有效。
                </p>
                <p>4， 借款人应妥善保管上海银行账户、密码、数字证书和与上海银行绑定的手机号码、
                    手机验证码等与上海银行有关的一切信息。借款人应确保不向其他任何人泄露上
                    海银行密码、手机验证码。对于因密码或手机验证码泄露所致的损失，由借款人
                    自行承担。如借款人发现有他人冒用或盗用借款人的上海银行账户及密码或任何
                    其他未经合法授权之情形时，应立即以有效方式通知贷款人。同时，借款人理解
                    贷款人对借款人的请求采取行动需要合理期限，在此之前，除法律明确规定外，
                    贷款人对已执行的指令及(或)所导致的借款人的损失不承担任何责任。
                </p>
                <p>5， 借款人同意在其未清偿所有应还款项时，若申请变更、注销借款人的任何一个上
                    海银行账户，均应事先征得贷款人的同意。
                </p>
                <p>6， 借款人应保证还款账户余额充足且可被扣收，并按本合同的约定归还全部贷款本
                    息及其他有关费用。
                </p>
                <p>7， 借款人应按本合同约定的用途使用贷款，未经贷款人书面同意借款人不得将贷款
                    挪作他用。</p>
                <p>8， 借款人应根据贷款人的要求及时提供贷款资金使用记录和资料。</p>
                <p>9， 借款人不得将贷款用于基金、股票、理财产品、有价证券、期货买卖及股本权益
                    性投资。</p>
                <p>10， 借款人不得利用本合同或本合同项下的贷款规避相关法律法规或规章的要求(包
                    括但不限于税务方面政策法规的要求)，否则与此相关的任何法律责任应由借款
                    人自行承担，与贷款人无关。</p>
                <p>11， 借款人承诺配合贷款人进行贷款支付管理、贷后管理及相关检查，包括但不限于
                    接受贷款人对本合同项下贷款使用情况和有关借款人财务活动情况进行监督和检
                    查，按照贷款人的要求及时提供真实、准确、完整的资料，并为贷款人的前述监
                    督和检查提供工作方便。</p>
                <p>12， 借款人变更通讯地址、电子邮件地址、手机号码、和上海银行账户等事项的，应
                    于变更后五日内书面通知贷款人。</p>
                <p>13， 借款人进行对外投资、实质性增加债务融资，以及进行合并、分立、股权转让等
                    重大事项前应征得贷款人同意。</p>
                <p>14， 如发生对借款人的正常财务情况构成威胁或对借款人履行本合同项下的义务产生
                    不利影响的任何其他事件，包括但不限于涉及或可能涉及经济纠纷、财务状况恶
                    化等，均应在该等情形发生之日起五日内书面通知贷款人。</p>
                <p>二， 贷款人的主要权利和义务</p>
                <p>1， 贷款人应按照本合同的约定履行权利义务。</p>
                <p>2， 贷款人有权直接或委托第三方对贷款的使用情况和有关借款人的个人状况、家庭
                    情况、财务活动等情况进行监督和检查。</p>
                <b>3， 如贷款人发现 a)借款人在上海银行线上贷款平台及/或合作平台系统中的行为数
                    据或其他信息发生异常变化；或 b)借款人在贷款人、贷款人关联公司、及与贷
                    款相关的网站上注册的账户出现异常现象；或 c)借款人发生本合同约定的违约情
                    形；或 d)借款人不履行或违反与贷款人、贷款人关联公司相关方的其他任何合
                    同（如有）项下借款人应承担的任何义务，已经或可能影响借款人履行本合同项
                    下义务，贷款人有权基于合理怀疑停止向借款人发放贷款或宣布贷款提前到期或
                    对借款人的上海银行账户（如有）采取限制措施或采取本合同约定或法律允许的
                    其他救济措施。</b>
                <b>第十三条 信息收集、使用、共享与保护</b>
                <b>一， 收集借款人的信息</b>
                <b>1， 借款人了解并同意当借款人访问上海银行线上贷款平台及其相关网站、贷款移
                    动设备客户端、合作平台或借款人使用上海银行的服务时，借款人须向上海银
                    行主动提供一些信息，且借款人同意并授权上海银行为本合同项下贷款之目的
                    通过以下途径获取借款人的信息：</b>
                <b>1) 收集借款人留存在上海银行的关联公司处的信息；</b>
                <b>2) 收集借款人留存在上海银行合作伙伴（包括但不限于担保公司、证券机
                    构、银行、合作平台等，下同）处的信息；</b>
                <b>3) 向中国人民银行金融信用信息基础数据库、依法设立的征信机构、资信
                    评估机构或有关法律、监管机构许可的类似机构（以下统称“征信机构”）查
                    询、核实、打印、留存借款人的信息和信用报告；</b>
                <b>4) 向行政机关、司法机关查询、打印、留存借款人信息；</b>
                <b>5) 向合法留存借款人信息的自然人、法人以及其他组织收集借款人的信息。</b>
                <p>2， 借款人同意并不可撤销地授权上海银行收集的借款人信息包括但不限于：</p>
                <p>1) 借款人及其关联方的身份信息，包括但不限于姓名/名称、证件号码、
                    证件类型、住所地、电话号码以及其他身份信息；</p>
                <p>2) 借款人在申请、使用上海银行提供的服务时所提供以及形成的任何数据
                    和信息，包括但不限于借款人的信息以及借款人提供的其关联方的信息；</p>
                <p>3) 借款人的信用信息，包括但不限于借款人的征信记录和信用报告；</p>
                <p>4) 借款人的财产信息，包括但不限于借款人的个人状况、财税信息、房产
                    信息、车辆信息、基金、保险、股票、信托、债券等投资理财信息和负债信息
                    等；<strong>借款人同意并确认，在将前述信息提供给贷款人之前已清楚知晓可能带来
                        的不利后果，包括但不限于基于前述信息对借款人做出的负面评价。</strong></p>
                <p>5) 借款人在行政机关、司法机关留存的任何信息，包括但不限于户籍信息
                    /工商信息、诉讼信息、执行信息和违法犯罪信息等；</p>
                <p>6) 与借款人申请或使用的上海银行服务相关的、借款人留存在其他自然人、
                    法人和组织的其他相关信息。</p>
                <p>二， 使用借款人的信息</p>
                <p>为了更好地为借款人提供服务，也为了上海银行自身的信贷风险防控，借款人同意并
                    不可撤销地授权上海银行将借款人的信息用于如下用途：</p>
                <p>1， 创建数据分析模型，为借款人提供适合于借款人的融资、担保、保理、保险、理
                    财、网络平台、技术等服务，并维护、改进上述服务；</p>
                <p>2， 比较信息的准确性并与第三方进行验证；</p>
                <p>3， 合理评估借款人和/或其关联方的经营状况，防控风险；</p>
                <b>4， 因借款人和/或其关联方与上海银行的纠纷未能够协商解决而需要通过借助催收及
                    法律途径解决的，上海银行有权将借款人的信息提供给催收公司、律师事务所、
                    法院、仲裁委员会和其他有权机关；</b>
                <p>5， 预防或阻止非法的活动；</p>
                <p>6， 保护借款人的账户安全；</p>
                <p>7， 经借款人许可的其他用途。</p>
                <p>三， 分享借款人的信息</p>
                <p>上海银行对借款人的信息承担保密义务，不会为满足第三方的营销目的而向其出售或
                    出租借款人的任何信息。但上海银行在下列任一情况下有权将借款人的信息与第三方
                    共享，借款人对此无异议：</p>
                <b>1， 为了向借款人提供或推荐上海银行关联公司的服务和/或产品的需要或基于风险防
                    控需要，将借款人的信息提供给上海银行的关联公司使用，且借款人同意上海银
                    行的关联公司通过电子邮件、手机短信和传真等方式向借款人发送服务状态的通
                    知、营销活动及其他商业性电子信息；</b>
                <b>2， 某些服务和/或产品和/或推广活动由上海银行的合作伙伴提供或由上海银行与合
                    作伙伴共同提供，上海银行会与其共享并使用；</b>
                <b>3， 为建立信用体系，向监管机构认可的征信机构发送借款人的信息，借款人同意并
                    不可撤销地授权上海银行将借款人的信息（包括不良记录信息）发送征信机构且
                    不再另行通知借款人；</b>
                <b>4， 若借款人在本合同下的任何应付款项逾期，借款人不可撤销地授权并同意上海银
                    行有权在上海银行及其关联公司旗下任一网站、其他媒体和上海银行认为必要的
                    区域范围内的任意位置公示借款人违反本合同的相关信息，包括但不限于姓名/名
                    称、肖像、证件号码、住址、具体违约状况等信息；借款人同意上海银行及其关
                    联公司有权停止向借款人提供任何服务，因此给借款人造成损失的，前述主体均
                    不承担赔偿责任；</b>
                <b>5， 当借款人违反本合同约定时，为维护上海银行合法权益，向与上海银行合作的催
                    收公司、律师事务所等披露借款人的违约信息；</b>
                <b>6， 借款人同意上海银行根据有关监管规定，将与本合同有关的信息和借款人其他相
                    关信息向监管部门、行业自律组织和监管信息系统报送，供有关部门使用和借款
                    人授权查询使用；</b>
                <p>7， 根据法律法规的规定及有权机关的要求；</p>
                <b>8， 借款人同意或授权的其他情形。</b>
                <p>四， 借款人的信息保护</p>
                <p>上海银行将根据法律法规规定对借款人的信息予以保密，但下列情形除外：</p>
                <p>1， 法律、法规、规章及其他规范性文件另有规定；</p>
                <p>2， 本合同另有约定。</p>
                <b>第十四条 违约及其违约处理</b>
                <b>一， 违约情形：</b>
                <b>借款人发生下列任一情况，即构成违约：</b>
                <b>1， 借款人未按本合同规定按时足额偿还贷款本息或其他应付款项；</b>
                <b>2， 借款人未按本合同约定用途使用贷款的；</b>
                <b>3， 借款人向上海银行提供虚假的信息；</b>
                <b>4， 借款人被宣告失踪、处于限制民事行为能力或丧失民事行为能力状态、被刑事监
                    禁、或发生重大疾病、重大事故等可能危及本合同项下贷款安全的情况；</b>
                <b>5， 借款人卷入或即将卷入重大的诉讼或仲裁程序及其他法律纠纷，足以影响借款人
                    的偿债能力；</b>
                <b>6， 借款人转移资产，以逃避债务的；</b>
                <b>7， 借款人未履行对上海银行或其关联公司负有的其他到期债务，或上海银行发现借
                    款人有其他拖欠债务的行为的；</b>
                <b>8， 借款人的资信情况或还贷能力出现其他重大不利变化（包括但不限于工作调整，
                    收入降低、失业、重大疾病、拖欠其他债务、承担重大负债等）；</b>
                <b>9， 借款人违反本合同约定的其他义务。</b>
                <b>二， 违约救济措施</b>
                <b>如借款人出现本条第一款所述之任何违约情形，或违背借款人在本合同项下其他任何
                    义务、陈述、保证或承诺的，上海银行有权采取下列一项或多项措施，包括但不限于：</b>
                <b>1， 要求借款人限期纠正违约行为。</b>
                <b>2， 停止依据本合同或借款人与上海银行之间的其他合同向借款人发放任何贷款。</b>
                <b>3， 自主决定本合同和借款人与上海银行之间其他合同项下借款人未偿还的贷款全部
                    或部分提前到期，并要求借款人提前全部清偿。</b>
                <b>4， 处分抵押/质押财产或要求保证人代偿（如有），实现上海银行的债权。</b>
                <b>5， 对借款人上海银行的所有账户（如有）采取冻结存款和其他资产，停止取现，限
                    制转账等限制措施；</b>
                <b>6， 从借款人的任何一个或多个银行账户（如有）存款或其他资产（包括但不限于已
                    止付的各类保证金）中扣收全部或部分贷款本息和其他应付款项，如果账户中款
                    项的币种与贷款币种不同，贷款人有权按扣款当日中国人民银行公布的外汇中间
                    价折算成贷款币种清偿贷款。</b>
                <b>7， 若借款人在上海银行关联公司处有任何应收或留存款项，上海银行有权直接通过
                    其关联公司自前述款项中扣划相应金额用以偿还借款人在本合同项下的欠款。</b>
                <b>8， 以合法手段追偿贷款（包括但不限于委托债务催讨公司、律师事务所等其他第三
                    方机构代为追讨，申请相关部门进行调查、向法院提起诉讼等），由此引起的一
                    切费用（包括但不限于诉讼费、财产保全费、执行费、仲裁费、律师代理费、差
                    旅费、评估费、拍卖费、催收费用等）由借款人承担。</b>
                <b>9， 上海银行根据法律法规规定或本合同约定有权采取的其他违约救济措施。</b>
                <b>第十五条 特别约定</b>
                <b>1，本贷款网络平台信息系统因下列状况无法正常运作，使借款人无法使用各项服务或
                    使上海银行无法履行本合同时，上海银行不承担损害赔偿责任，该状况包括但不限于：
                    <b>（一）在贷款网络平台或与本合同项下贷款相关的其他平台公告之系统维护期间。</b>
                    <b>（二）因病毒、木马、恶意程序攻击、网络拥堵、系统不稳定、系统或设备故障、通
                        讯故障、电力故障、银行原因、第三方服务瑕疵或政府行为等原因；</b>
                    <b>（三）电信设备出现故障不能进行数据传输的。</b>
                    <b>（四）因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力之因素，造成
                        上海银行系统障碍不能执行业务的。</b>
                    <b>（五）由于黑客攻击、电信部门技术调整或故障、网站升级、银行方面的问题等原因
                        而造成的服务中断或者延迟。</b>
                    <b>（六）借款人操作不当或未按照贷款人授权或认可方式使用贷款网络平台的。</b>
                    <b>2，本合同有效期内，因国家相关主管部门颁布、变更法律、法规、规章、规定、指引、
                        通知、政策及其他规范性文件等导致贷款人或相关方不能提供约定服务的，不视为其
                        违约，各方可根据相关规定变更合同内容或提前终止本合同。</b>
                    <b>3，借款人理解本合同所涉服务有赖于贷款平台或其他合作平台系统的准确运行及操作。
                        若出现贷款平台系统差错、故障或其他原因引发了展示错误、借款人或贷款人或相关
                        方不当获利等情形的，借款人同意贷款人或相关方可以自行或通过第三方采取更正差
                        错、扣划款项、暂停服务等适当纠正措施。</b>
                    <b>第十六条 合同的适用法律及争议解决方式</b>
                    <b>一、本合同适用中华人民共和国法律。本合同在履行过程中发生争议，可以协商解决，
                        协商不成，向合同签订地人民法院起诉。在诉讼期间，本合同不涉及争议部分的条款
                        仍须履行。</b>
                    <b>二、强制执行公证(若有)</b>
                    <b>1、贷款人及借款人均同意对本合同办理赋予强制执行效力的债权文书公证，且双方对
                        赋予强制执行效力的债权文书公证之含义、内容、程序、效力等完全清楚。</b>
                    <b>2、若借款人未按照本合同约定履行还款义务或违反本合同其他约定、承诺或保证的，
                        贷款人有权向公证机构申请出具执行证书，并向有管辖权的人民法院申请执行，借款
                        人自愿接受人民法院的强制执行，而无须经过诉讼程序，由此产生的相关费用（包括
                        但不限于追索费等）按债权总额的 30%计收。借款人承诺自愿放弃抗辩权。本条款优
                        先于本条第一款的适用。</b>
                    <b>第十七条 合同的变更、解除和权利义务的转让</b>
                    <b>一、合同的变更和解除</b>
                    <b>1、上海银行有权不定期修改本合同，但相关修改不得加重借款人在贷款金额、利（费）
                        率和期限方面的责任。一旦条款产生变动，上海银行将以短信或其他书面形式通知借
                        款人。</b>
                    <b>2、除法律法规另有强制性规定外，经修订的合同一经通知，立即自动生效。一旦借款
                        人继续使用本贷款服务即被视为借款人已接受了修改后的合同内容；如借款人不同意
                        相关变更，应自上海银行的前述通知发出之日起 5 天内停止使用贷款并在上海银行要
                        求的期限内归还全部贷款本息和费用。</b>
                    <b>3、本合同生效后，除本合同另有约定外，借款人不得要求单方擅自变更或解除本合同。
                        上海银行有权基于自身经营考虑，随时宣布中断、终止本合同或其任何部分，并要求
                        借款人在约定期限内偿还本合同项下贷款本息和费用。</b>
                    <b>二、合同权利义务的转让</b>
                    <b>未经上海银行书面同意，借款人不得将本合同项下的权利和义务转让给任何第三方。
                        上海银行有权将其在本合同项下的权利和义务全部或部分转让给第三方，且上海银行
                        的转让行为无须征得借款人的同意，但上海银行将以短信、书面或电话形式向借款人
                        通知该等转让行为。</b>
                    <b>第十八条 通知及送达</b>
                    <b>一、本合同履行过程中，上海银行传递给借款人的书面通知（包括但不限于催收通知、
                        债权转让通知等），按照借款人在贷款网络平台信息系统中填写的通讯地址交邮后的
                        第三个自然日即视为送达。书面通知的形式还包括但不限于上海银行采用在贷款网络
                        平台公告、向借款人发送电子邮件、手机短信和传真等电子方式，在采用电子方式进
                        行书面通知的情况下发送当日即视为送达。</b>
                    <b>二、借款人承诺及声明：</b>
                    <b>（一）对于因合同争议引起的任何纠纷，司法机关（包括但不限于人民法院）可以手
                        机短信或电子邮件等现代通讯方式或邮寄方式向本人送达法律文书（包括但不限于诉
                        讼文书）。</b>
                    <b>（二）本人指定接受法律文书的手机号码或电子邮箱为本人在贷款网络平台或合作平
                        台注册或合同签约时输入手机号码或电子邮箱，司法机关按前述码址发出的法律文书
                        即视为送达。</b>
                    <b>（三）本人指定邮寄地址为本人的户籍地址或本人在贷款网络平台或合作平台注册或
                        合同签约时留存的本人通讯地址、收件地址或住址。</b>
                    <b>（四）本人同意司法机关可采取以上一种或多种送达方式向本人送达法律文书，司法
                        机关采取多种方式向本人送达法律文书的，送达时间以上述送达方式中最先送达的为
                        准。</b>
                    <b>（五）本人确认的上述送达方式适用于各个司法阶段，包括但不限于一审、二审、再
                        审、执行以及督促程序。</b>
                    <b>（六）若本人送达地址发生变更，应及时告知贷款人和/或司法机关变更后的送达地址。</b>
                    <b>（七）督促程序中，若本人任意提出异议进而使纠纷进入诉讼程序，在法院最终判决
                        本人承担责任的情况下，因此产生的所有费用（包括但不限于律师费、支付令申请费、
                        诉讼费等），均由本人承担。</b>
                    <b>第十九条 特定担保或共同还款人的追加</b>
                    借款人同意，贷款人有权追加第三人为借款人提供连带责任保证，而无需另行通
                    知借款人，且借款人承诺在担保人承担保证责任后，有权立即向借款人追偿。</b>
                <b>第二十条 其他</b>
            </div>
            <div class="btn w690 mt30" @click="pswDialog=true" v-if="isShow==1">同意本协议</div>
        </div>
        <!--输入银行数字安全密码  -->
        <!-- <div class="pop" v-show="pswDialog"> -->
        <div class="pop" >

            <div class="bankPwd">
                <div class="title tc bbe">
                    <h2 class="f28">输入银行数字安全密码</h2>
                    <span class="closePop" @click="fClose"></span>
                </div>
                <div class="bd">
                    <ul class="fix">
                        <li v-for="n in 6" :class="{'active' : n <= pwd.length}">
                            <span></span>
                        </li>
                    </ul>
                </div>
                <!--键盘  -->
                <ul class="keyboard fix tc">
                    <li class="keyItem" @click="numStack('1')">
                        <p>1</p>
                    </li>
                    <li class="keyItem colCenter" @click="numStack('2')">
                        <p>2</p>
                        <p class="enLetter">ABC</p>
                    </li>
                    <li class="keyItem" @click="numStack('3')">
                        <p>3</p>
                        <p class="enLetter">DEF</p>
                    </li>
                    <li class="keyItem" @click="numStack('4')">
                        <p>4</p>
                        <p class="enLetter">GHI</p>
                    </li>
                    <li class="keyItem colCenter" @click="numStack('5')">
                        <p>5</p>
                        <p class="enLetter">JKL</p>
                    </li>
                    <li class="keyItem" @click="numStack('6')">
                        <p>6</p>
                        <p class="enLetter">MNO</p>
                    </li>
                    <li class="keyItem" @click="numStack('7')">
                        <p>7</p>
                        <p class="enLetter">PQRS</p>
                    </li>
                    <li class="keyItem colCenter" @click="numStack('8')">
                        <p>8</p>
                        <p class="enLetter">TUV</p>
                    </li>
                    <li class="keyItem" @click="numStack('9')">
                        <p>9</p>
                        <p class="enLetter">WXYZ</p>
                    </li>
                    <li class="keyItem grayBg" @click="numStack('.')">
                        <p class="keyDot">.</p>
                    </li>
                    <li class="keyItem colCenter" @click="numStack('0')">
                        <p class="keyZero">0</p>
                    </li>
                    <li class="keyItem grayBg" @click="numStack('deleteNum')">
                        <span class="keydel"></span>
                    </li>
                </ul>
            </div>
        </div>
    </div>
</template>
<style lang="sass" scoped>
    .wrapBox {
        height: 100%;
        padding-top: 20px;
    }

    .inner {
        height: 100%;
        padding-bottom: 30px;
        display:-webkit-flex;
        display:-webkit-box;
        -webkit-flex-direction:column;
        -webkit-box-orient:vertical;
    }

    .w690 {
        width: 690px;
    }

    .box {
        flex:1;
        overflow-x: hidden;
        overflow-y: auto;
        line-height: 46px;
        word-break: break-all;
        text-align: justify;
    }
    b {
        display: block
    }

    .pr100 {
        padding-right: 100px;
    }

    .pop {
        width: 100%;
        height: 100%;
        position: fixed;
        top: 0;
        left: 0;
        z-index: 9999;
        background-color: rgba(0, 0, 0, 0.5);
    }

    .bankPwd .bd {
        border: 1px solid #bdbdbd;
        width: 633px;
        margin: 50px auto;
        overflow: hidden;
    }

    .bankPwd li {
        width: 105px;
        height: 24px;
        padding: 40px 0 52px 0;
        float: left;
        border-right: 1px solid #efefef;
    }

    .bankPwd li.active span {
        width: 16px;
        height: 16px;
        border-radius: 16px;
        background-color: #000;
        display: block;
        margin: 0 auto;

    }

    .bankPwd li:last-child {
        border-right: 0;
    }

    .bankPwd, .payDetail {
        position: fixed;
        width: 100%;
        bottom: 0;
        background-color: #fff;
        z-index: 9999;
    }

    .title {
        height: 100px;
        line-height: 100px;
    }

    .payDetail .wrap {
        margin-top: 0;
    }

    .content {
        padding: 100px 0;
    }

    .closePop {
        position: absolute;
        left: 30px;
        top: 0px;
        display: block;
        width: 40px;
        height: 40px;
        padding: 40px;
    }

    .closePop:before, .closePop:after {
        position: absolute;
        top: 28px;
        left: 50%;
        display: block;
        content: ' ';
        width: 3px;
        height: 40px;
        background-color: #aaa;
    }

    .closePop:before {
        transform: rotate(45deg);
    }

    .closePop:after {
        transform: rotate(-45deg);
    }

    /*键盘  */
    .keyboard {
        border-top: 1px solid #e8e8e8;
    }

    .keyboard .keyItem {
        float: left;
        padding-top: 16px;
        height: 96px;
        width: 33%;
        border-bottom: 1px solid #8c8c8c;
        color: #000;
        line-height: 36px;
        font-size: 40px;
    }

    .keyboard .colCenter {
        width: 34%;
        border-width: 0 1px 1px;
        border-style: solid;
        border-color: #8c8c8c;
    }

    [data-dpr="1"] .keyboard .colCenter {
        border-width: 0 1px 1px !important;
    }

    .keyboard .keyItem .enLetter {
        color: #030303;
        font-size: 22px;
    }

    .keyboard .grayBg {
        background-color: #F9F9F9;
    }

    .keyboard .keyItem:active {
        background-color: #d2d5da;
    }

    .keyboard .grayBg:active {
        background-color: #fff;
    }

    .keyboard .keydel {
        display: inline-block;
        margin-top: 14px;
        width: 46px;
        height: 34px;
        background: url(../transferAccount/images/icon_keydel.png) no-repeat;
        background-size: 100% 100%;
    }

    .keyboard .keyZero {
        padding-top: 16px;
    }

    .keyboard .keyDot {
        width: 8px;
        height: 8px;
        background-color: #000;
        border-radius: 8px;
        margin: 30px auto;
        text-indent: -1000px;
    }
      b, p {
        font-weight: 300;
      }
</style>
<script src="./loanContract.js"></script>
